<details><summary>Digger run report at 2024-02-29 12:13:19 (UTC)</summary>
  <details><summary>Apply for <b>diggerhq/demo-terragrunt-parallel#dev-svc-identity</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example must be replaced
-/+ resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::demo-terragrunt-parallel-app-d" -> (known after apply)
      ~ bucket                      = "demo-terragrunt-parallel-app-d" -> "demo-terragrunt-parallel-svc-identity-dev" # forces replacement
      ~ bucket_domain_name          = "demo-terragrunt-parallel-app-d.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "demo-terragrunt-parallel-app-d.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "demo-terragrunt-parallel-app-d" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "48ca234ec08b854fd7875d07ed50011a403a0297310717063d53e2085019f22f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
aws_s3_bucket.example: Destroying... [id=demo-terragrunt-parallel-app-d]
aws_s3_bucket.example: Destruction complete after 0s
aws_s3_bucket.example: Creating...
aws_s3_bucket.example: Creation complete after 0s [id=demo-terragrunt-parallel-svc-identity-dev]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

  ```
</details>
</details>